app/controllers/application_controller.rb

  before_action :force_tablet_html
#  has_mobile_fu
  before_action do
    RecordWithOperator.operator = current_user.present? ? current_user : current_comp.present? ? current_comp : User.first
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]