app/controllers/parts_controller.rb

SELECT "parts_stores".* FROM "parts_stores" WHERE "parts_stores"."deleted_at" IS NULL ORDER BY "parts_stores"."parts_stroke" ASC
---
  def index
    @breadcrumbs = []
    add_breadcrumb(t('breadcrumbs.parts'))
    if params[:kanji].blank?
      @goi = PartsStore.all.order(:parts_stroke)