app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", "14d8852a-a349-4a2c-8323-728591db3dd3"], ["LIMIT", 1]]
---
  def parent
    @user = User.find(params[:id])