app/controllers/users_controller.rb

  def index
    @users = User.where(company_flg: true)
    @users = @users.where(userid: params[:search][:userid]) if params[:search].present? && params[:search][:userid].present?
    @users = @users.page(params[:page]).per(params[:per])
---
SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_flg" = $1  [["company_flg", true]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", "12b80ad1-f1f1-4c25-8158-ab027af01ed9"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_flg" = $1 LIMIT $2 OFFSET $3  [["company_flg", true], ["LIMIT", 50], ["OFFSET", 0]]

  def update
    @user.assign_attributes(user_params)
    begin
      ActiveRecord::Base.transaction() do
        if @user.save
---
UPDATE "users" SET "updated_at" = $1, "sei" = $2, "mei" = $3, "sei_kana" = $4, "mei_kana" = $5, "mobile" = $6 WHERE "users"."id" = $7

  def parent
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", "14d8852a-a349-4a2c-8323-728591db3dd3"], ["LIMIT", 1]]